1.自建城市10人口以下不消耗快乐，10人口以上仅消耗0.5快乐，城市带来不快乐大幅增加。

2.奢侈品资源提供快乐随科技发展而增加（貌似暂时还实现不了，政策倒是有实现途径），减少初期建造城市对奢侈品资源的强烈依赖，同时为早期无奢侈城市提供生存空间。快乐获得途径更依赖于城市的发展，即向多个建筑、甚至城市人口转移。

3.增加Bonus Resource、Natural Wonder的获益，Natural Wonder的快乐加成由发现获得转变为境内获得（Bonus Resource可以是粮食、工业、金钱方面，Natural Wonder可扩展到文化、科研方面，奢侈品资源主要是金钱方面）

4.延长快乐盈余积累后获得黄金时代的长度

5.黄金时代工业、商业获益均改为百分比计算

6.盈余快乐可借助政策而在各方面产出获得加成，避免奢侈品资源只有卖的作用

7.考虑到文明5升级的好处实在太多，适当拔高升级兵种价格

8.借助建筑，资源可以很无敌。另外，建筑能够实现的功能比想象中的多，推倒重来还是很有可能的

9.国家奇迹仅需半数以上城市拥有相应建筑，但成本随城市数增加上升更快，国家奇迹建造过程中有新城市建成时，仅增加成本不中止建造。

10.大商交易获得金币增多，大科获得瓶子数有限，除大艺外其他伟人黄金时代缩短

11.取消法院。占领城市及人口不快乐上升至非占领城市的1.5倍

12.这个是旧的意见。当前沿河草原/非沿河草原的粮食盈余比为2:1，沿河平原/非沿河平原的粮食盈余比为1:0。虽然有必要体现沿河优势，但地图随机性太大，要考虑给非沿河城市更多发展空间，可把沿河草原/非沿河草原的粮食盈余比调整为3:2，沿河平原/非沿河平原的粮食盈余比调整为2:1（意味着人口消耗3粮食）。此外，河流对地块+1金改为沿河贸易站+1金。

13.兵种相克，进攻防御额外加成均可实现，意味着可以把矛兵等设定为防御力较强的兵种，而骑士则可设定为进攻较强的兵种。

14.城邦关系划分3级：Friends（当前Friends的额外加成），Good Friends（当前Ally的额外加成），Ally（提供Resource+战争同盟）。提高其获取成本，维持或者略微降低其维持成本（即拔高关系所需好感度，而好感度下降速度或金钱所能获得好感度不变）

15.航海城邦提供定量有限粮食，文化城邦提供文化直接加入城市？